print('''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/_____ /
*******************************************************************************
''')

print("Chào mừng bạn đến với Truy Tìm Kho Báu.")
print("Nhiệm vụ của bạn là hoàn thành nhiệm vụ vào tìm được kho báu.")

choice1 = input("Bạn đang trên một con đường. Bạn có hai lựa chọn: 'bên trái' hay 'bên phải'. Hãy chọn 'trái' hay 'phải': \n---> ").lower()
if choice1 == "trái":
    choice2 = input("Bạn đã đến một cái hồ. Có một hòn đảo ở giữa hồ. Gõ 'chờ' để chờ thuyền. Gõ 'bơi' để bơi qua: \n---> ").lower()
    if choice2 == "chờ":
        choice3 = input("Bạn đến hòn đảo mà không hề gặp gì. Có một ngôi nhà có 3 cửa: Một cửa màu đỏ, một cửa màu vàng và một cửa màu xanh. Bạn chọn cửa màu nào? \n ---> ").lower()
        if choice3 == "đỏ":
            print("Bạn vào căn phòng toàn lửa. Bạn đã thua.")
        elif choice3 == "vàng":
            print("Chúc mừng! Bạn đã tìm thấy kho báu.")
        elif choice3 == "xanh":
            print("Bạn vào căn phòng chứa hồ nước sâu. Bạn đã thua.")
        else:
            print("Bạn đã thua.")
    else:
        print("Bạn bị tấn công bởi thú dữ. Bạn đã thua.")
else:
    print("Bạn rơi vào cái hố lớn. Bạn đã thua.")